In [1]:
import pandas as pd
import numpy as np

In [8]:
data_dic = {'name': ['sohail', 'danyal','hamza','mehran'], 'age': [28,27,22,np.nan]}

In [9]:
data = pd.DataFrame(data_dic)

In [10]:
data.head()

     name   age
0  sohail  28.0
1  danyal  27.0
2   hamza  22.0
3  mehran   NaN

In [17]:
# missing number of row is dropped 
data = data.dropna()

In [18]:
data.head()

     name   age
0  sohail  28.0
1  danyal  27.0
2   hamza  22.0